bolund2D/bolund_simpleFoam/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type atmBoundaryLayerInletVelocity;
        #include "include/ABLConditions"
    }
    
    outlet
    {
        type  pressureInletOutletVelocity;
		value uniform (0 0 0);
    }
    
    wall
    {
        type            noSlip;
    }
    
    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
